//Пусть на множестве A введена бинарная операция *, то есть, 
//каждой упорядоченной паре элементов x, y ∈ A сопоставлен элемент x * y ∈ A.
//Такая операция называется ассоциативной, если (x * y) * z = x * (y * z) для любых элементов x, y, z ∈ A.
//Примеры ассоциативных операций - сложение или умножение обычных чисел (в школе это называли сочетательным законом), 
//или композиция функций. Примеры неассоцитивных операций - вычитание, деление, возведение в степень. 
//Математики называют множество с ассоциативной операцией группой.
//Вам нужно проверить, является ли заданная операция на n-элементном множестве A ассоциативной. 
//Будем считать, что элементы множества A пронумерованы числами от 0 до n-1: A = {a0, …,   an-1}.

#include <iostream>
#include <vector>

using namespace std;

int main() {
    int n;
    cin >> n;
    vector<vector<int>> matrix(n, vector<int>(n));
    for (int i = 0; i < n; i++)
        for (int j = 0; j < n; j++)
            cin >> matrix[i][j];
    bool is_associative = true;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            for (int k = 0; k < n; k++) {
                int a1 = matrix[matrix[i][j]][k];
                int a2 = matrix[i][matrix[j][k]];
                if (a1 != a2)
                    is_associative = false;
            }
        }
    }
    if (is_associative)
        cout << "YES" << endl;
    else
        cout << "NO" << endl;
}
